{
    "blogs": [
      {
        "title": "Staying Calm When You're Stressed",
        "body": "Daniel Levitin at the TED Conference talks about how easy it 
        is to get stressed with the simplest things but with proper planning, 
        stressful situations can be tackled calmly. Stress fogs our thinking and
        leads to bad performance which in turn you become more stressed and incapable
        of doing the easiest tasks.

        Levitin talks about a strategy called the premortem to avoid making 
        critical mistakes in stressful situations. Premortem is a hypothetical 
        opposition to postmortem. For instance, in a medical setting, postmortem 
        allows doctors to learn about a patient's health hazards. While premortem 
        is a forward-looking process to identify vulnerabilities in the plan. 
        Unlike looking back at the mistakes leading to failure, we train ourselves 
        to think ahead of such possible situations to avoid failure. Similarly, 
        in life at certain moments people are bound to fail. Such situations cannot 
        be avoided however, the decisions we make can be polished to avoid failures.
        So that if we were ever to face difficult circumstances, it could be tackled
        calmly the way we intended rather than be stressed about it. 
        
        The whole idea of the talk is to train ourselves ahead of a particular
        circumstance and recognizing the flaws to minimize the damage. I fully agree
        with Levitin as we all are going to fail now and then. Instead of being 
        stressed about it, we can actually prevent bad things from happening in the 
        first place and deal with them calmly and collectively.
        ",
        "author": "Anisha",
        "id": 1
      },
      {
        "title": "Importance of Transferrable Skills in a Workplace ",
        "body": "Throughout the working career, people do all kinds of jobs. These jobs help 
        people in learning valuable skills that are transferrable in any field of work. Likewise,
        companies seek employees who have all-rounder skills while recruiting their team members.
         Hence, they seek out who you are and what you bring to the company. And having 
         transferrable skills help people stand out to employers. 

        As the name says, transferrable skills are valuable skills and abilities that fit every
        role available in the job market. Some of the top transferrable skills are communication, 
        critical thinking, problem-solving skills, leadership, teamwork, active listening, 
        adaptability, technical skills, and more. 
        
        Communication skills
        
        Every organization, be it big or small, all rely upon communication. Communication helps 
        employees to stay on the same page. Hence, it is important to be skillful in all means of 
        communication i.e. listening, writing, and face-to-face communication.
        
        Leadership and Teamwork
        
        Similarly, leaders are motivators that help the team stay in tact. A good leader guides his 
        fellow team in achieving their objective. As well, being a team player is equally important
        as being a good leader. Furthermore, other organizational skills such as time management,
        adaptability, critical thinking, creativity all play important aspects that help people
        grow in a workplace.
        
        I believe that being able to identify one's transferrable skills can help people in every 
        path of career they choose. Not only does it benefit the organization but they are ours to 
        keep which will help us adapt, and grow professionally.  ",
        "author": "Anisha",
        "id": 2
      }
    ]
}