{
  "blogs": [
    {
      "title": "Harmony Day",
      "body": "Australia is a culturally diverse country. With people coming from every corner of the world, various cultures exist calling Australia their home. 21st of May every year marks Harmony Day where people come together to celebrate each other's culture and learn to respect one another's differences. Orange is the official color for Harmony Day signifying social interaction, freedom of expression, and brotherhood.\nMarking the entire week, Harmony week is celebrated in schools, communities, workplaces, sporting groups, local councils with a message of \"Everyone belongs\". Students and colleagues communicate and come together through sports, food, music, and arts promoting cultural diversity. Everyone is encouraged to promote their values, equality, and freedom so they can connect with communities. Many such activities are conducted within their workspaces until the main day where huge events are held. On this day, series of cultural events are held where people can participate to exchange the culture. People celebrate by sharing traditional values and customs and sharing their food, arts, dance, and story. \nThe diverse nationality and cultures are what makes Australia today. Learning about the different cultures widens the knowledge that can help in creating a world where everyone can co-exist. As one culture fills the flaw of another culture, Harmony day creates a world without conflict and with peace and tranquillity. It creates an environment for everyone to connect, work together and be happy. Hence, it is important to be open to accepting all cultures for generations to come. \n\nWith the message of \"You + Me = Us, \" this day aims to eradicate prejudice against different cultures and build a peaceful and respectful society for people of different ethnicities. To create a world where everyone is treated as equal. So let us join our hands together to admire and enrich our diverse community.",
      "author": "Anisha",
      "id": 13
    },
    {
      "title": "Woolworths, Making Life Healthier!! ",
      "body": "Everybody wants a balanced nutritional choice for their diet. To top it off, organic products have become people’s choice for food products. Woolworths brings a wide range of organic products of Macro Wholefoods to not only health-conscious shoppers but all the families. Macro Wholefoods products contain 80 varieties of nutritional and quality products such as salt, organic veggies like potatoes and broccoli, free-range chicken at a cheap price. For the time being, Woolworths intends to add more products by Macro upon assessing the consumer’s reaction. One of the spokespersons from Woolworths said, “It's a work in progress” as they review the brand's consumption. It is believed that now the product is favorable among 30 percent of the consumers that will hike even more in the time being. \nProduct Promotion \n\nThe goal of product promotion is to target the customer regarding the products. To advertise the brand, Woolworths has used various marketing strategies such as native advertising, posting onto their social networking sites, creating appealing product videos. Product sales promotion is done through various methods such as social media promotion through Facebook and Tweets, blogs on the Woolworths website, and more. Promotional videos are also created and posted on their YouTube Channel. Likewise, special deals and offers are placed on the products and later after-sale customer surveys are conducted for feedbacks upon the products purchased. \nCustomer Loyalty and increase in the Sale\n\nCustomer loyalty is a measure of likeliness that the customer is satisfied with the product and will consistently return to the company for the product and services. It is a mere result that the customers are happy with the services provided by the brand. Loyal customers of the Macro products increase profits by improving sales and help in product growth through mouth-to-mouth advertising. Furthermore, as the loyal customer’s demand keeps on increasing, Woolworths keeps on rewarding its customer by selling products at a bargain price every now and then. \n\nEnticing the customer \n\nIt is not rare for companies to put a quantity on top of quality. As the production keeps growing, the focus shifts from quantitative production and forgets the main aim of growing consumer demand. However, Woolworths tends to entice its loyal consumers along with production as they are the brand's main target. Conducting constant customer surveys to understand the consumer mentality, their demand, feedback, and negative and positive are ways to attract customers while keeping everyone happy and satisfied.",
      "author": "Anisha",
      "id": 14
    },
    {
      "title": "Importance of Transferrable Skills in a Workplace",
      "body": "Throughout the working career, people do all kinds of jobs. These jobs help people in learning valuable skills that are transferrable in any field of work. Likewise, companies seek employees who have all-rounder skills while recruiting their team members. Hence, they seek out who you are and what you bring to the company. And having transferrable skills help people stand out to employers. \n\nAs the name says, transferrable skills are valuable skills and abilities that fit every role available in the job market. Some of the top transferrable skills are communication, critical thinking, problem-solving skills, leadership, teamwork, active listening, adaptability, technical skills, and more. \n\nCommunication skills\n\nEvery organization, be it big or small, all rely upon communication. Communication helps employees to stay on the same page. Hence, it is important to be skillful in all means of communication i.e. listening, writing, and face-to-face communication.\n\nLeadership and Teamwork\n\nSimilarly, leaders are motivators that help the team stay intact. A good leader guides his fellow team in achieving their objective. As well, being a team player is equally important as being a good leader. Furthermore, other organizational skills such as time management, adaptability, critical thinking, creativity all play important aspects that help people grow in a workplace.\n\nI believe that being able to identify one's transferrable skills can help people in every path of career they choose. Not only does it benefit the organization but they are ours to keep which will help us adapt, and grow professionally.  ",
      "author": "Anisha",
      "id": 15
    },
    {
      "title": "Importance of Core Values",
      "body": "Whenever phrase core value comes up, everyone is expected to be honest, responsible, innovative and many more. But what exactly is core values and why it is so important. Core values are fundamental guidelines for a person or an organization. They are the principles that influence behavior, decisions and actions to follow the right path and achieve goals. Every known company like Amazon, Google, Facebook, Apple all have core values that they follow.\nEvery company has its own values that influence its work culture. It is not just about using a heavy words like integrity, diligence, responsibility, ethics. But core value is more about things that are actionable and doable. Simon Sinek, an inspirational speaker in his video conference states that core values are more about what we do and not what we say. But it is more about performing tasks following the core value principles.\n\nFrom a business perspective, companies must align their core values with their work culture and vision. A company that captures the essence of values into its business culture and practice often reaches its goals. For instance, one of Google's core values is to provide accurate information at any time to its customers faster across the web. Implementing this value into practice Google has earned customer trust and loyalty to acquire information. This shows that Google takes its values seriously and holds its employee's highest standards ensuring the mission and goals are achieved. Likewise, Apple's core value is to develop and innovate the best products in the market. Apple believes that every person is important and must have an opportunity to make a difference. And with Apple's products. the company intends to grow and innovate together with its customer. \n\nLastly, core values are principles that shape us in achieving our goals. I believe implementing such values we can understand the sense of integrity, know right from wrong and take appropriate decisions with confidence. ",
      "author": "Anisha",
      "id": 16
    },
    {
      "title": "Staying calm when you're stressed",
      "body": "Daniel Levitin at the TED Conference talks about how easy it is to get stressed with the simplest things but with proper planning, stressful situations can be tackled calmly. Stress fogs our thinking and leads to bad performance which in turn you become more stressed and incapable of doing the easiest tasks.\nLevitin talks about a strategy called the premortem to avoid making critical mistakes in stressful situations. Premortem is a hypothetical opposition to postmortem. For instance, in a medical setting, postmortem allows doctors to learn about a patient's health hazards. While premortem is a forward-looking process to identify vulnerabilities in the plan. Unlike looking back at the mistakes leading to failure, we train ourselves to think ahead of such possible situations to avoid failure. Similarly, in life at certain moments people are bound to fail. Such situations cannot be avoided however, the decisions we make can be polished to avoid failures. So that if we were ever to face difficult circumstances, it could be tackled calmly the way we intended rather than be stressed about it. \n\nThe whole idea of the talk is to train ourselves ahead of a particular circumstance and recognizing the flaws to minimize the damage. I fully agree with Levitin as we all are going to fail now and then. Instead of being stressed about it, we can actually prevent bad things from happening in the first place and deal with them calmly and collectively.\n",
      "author": "Anisha",
      "id": 17
    }
  ]
}